constant/foam.inp
species
(
    air
    H2O 
)
;

reactions
{}
